app/Helpers/auth_helper.php

    function hasPermission($roleId=false,$permission) {
        $db = \Config\Database::connect();
        $roleId =  session('user_data')['role'];
        $query = $db->table('role_permissions as rp')
            ->select('p.permission_name')
            ->join('permissions as p','p.id = rp.permission_id')
            ->where('rp.role_id',$roleId)
            ->where('p.permission_name',$permission)->get();
---
SELECT `p`.`permission_name`
FROM `role_permissions` as `rp`
JOIN `permissions` as `p` ON `p`.`id` = `rp`.`permission_id`
WHERE `rp`.`role_id` = '4'
AND `p`.`permission_name` = 'create_replay'