app/Helpers/settings_helper.php

SELECT `value`
FROM `app_settings`
WHERE `name` = 'company_name'
---
    function getappdata($name){
        $db = \Config\Database::connect();
        $builder = $db->table('app_settings');
        $query = $builder->select('value')->where('name',$name)->get();