app/Controllers/ActivitiesController.php

SELECT *
FROM `tasks`
WHERE `id` = '140'
 LIMIT 1
---
    function mYactivities($id=false) {

        $id = decryptor($id);
        $task = $this->taskModel->where('id',$id)->first();