app/Controllers/Notification.php

    function notifications(){
        $role = session('user_data')['role'];

        if ($role != 1)
        {
            $notify = $this->notifications->where(['user_id' =>session('user_data')['id'],'is_read' =>0 ])->findAll();
        }else
        {
            $notify = $this->notifications->where('is_read',0)->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '67'
AND `is_read` = 0
SELECT *
FROM `notifications`
WHERE `is_read` = 0