app/Controllers/ReplayController.php

SELECT *
FROM `task_staff_activities`
WHERE `task_staff_activities`.`id` = '904'
---
    function activityReplayHistory() {
         $replayModel = new ActivityReplayModel();
        if(!$this->request->isAJAX())
        {
            return $this->response->setJSON(['success' => false,'message' => 'invalid Request']);
        }
        $id = decryptor($this->request->getVar('taskId'));
        $getTask =  $this->taskstaffactivity->find($id);

SELECT *
FROM `task_staff_activities`
WHERE `task_staff_activities`.`id` = '934'
SELECT *
FROM `activities`
WHERE `activities`.`id` = '35'
---
    public function activityReplaySave() {
         $replayModel = new ActivityReplayModel();
        if(!$this->request->isAJAX()) {
            return $this->response->setJSON(['success' => false , 'msg' => lang('Custom.invalidRequest')]);
        }

        if(!haspermission('','create_replay')) {
            return $this->response->setJSON(['success' => false, 'message' => lang('Custom.accessDenied')]);
        }
        $validSuccess = false;
        $rules = [
            'replay' => 'required|min_length[1]|max_length[150]',
        ];
        if(!$this->validate($rules))
        {
           return $this->response->setJSON(['success' => $validSuccess,'errors' => $this->validator->getErrors()]);
        }

        $id = decryptor($this->request->getVar('taskId'));
        $getTask =  $this->taskstaffactivity->find($id);
        $taskDetail =  $this->activityModel->find($getTask['task_activity_id']);

INSERT INTO `notifications` (`user_id`, `type`, `task_id`, `activity_task_id`, `created_by`, `title`, `message`) VALUES ('67', 'activity_task_replay', '140', '35', '67', 'Task analytic Vs.Portal Reading Replayed ', 'Task analytic Vs.Portal Reading replayed  By Shikhil')
---
                'title'   => 'Task '.$taskDetail['activity_title'].' Replayed ',
                'message' => 'Task '.$taskDetail['activity_title'].' replayed  By '.session('user_data')['username']
            ];
            $this->notificationModel->insert($notify);