app/Models/ActivityReplayModel.php

SELECT `u`.`name`, `atr`.`id` as `rpId`, `atr`.`user_id`, `u`.`profileimg`, `atr`.`created_at`, `atr`.`reply_text`, COUNT(atr.master_task_id) OVER() AS message_count
FROM `task_staff_activities` as `tsa`
JOIN `activity_task_replies` as `atr` ON `tsa`.`id` = `atr`.`task_id`
JOIN `users` `u` ON `atr`.`user_id` = `u`.`id`
WHERE `atr`.`master_task_id` = '140'
AND `atr`.`master_activity_id` = '35'
---
    public function getReplay($taskId,$activityId) {
        $builder = $this->db->table('task_staff_activities as tsa')
                  ->select([
                        'u.name',
                        'atr.id as rpId',
                        'atr.user_id',
                        'u.profileimg',
                        'atr.created_at',
                        'atr.reply_text',
                        'COUNT(atr.master_task_id) OVER() AS message_count'
                    ])
                  ->join('activity_task_replies as atr','tsa.id = atr.task_id')
                  ->join('users u','atr.user_id = u.id')
                  ->where('atr.master_task_id',$taskId)
                  ->where('atr.master_activity_id',$activityId);